In [2]:
import numpy as np
import pandas as pd

In [3]:
from rpy2.robjects import r
from rpy2.robjects.pandas2ri import ri2py

r('library(MASS)')
boston = ri2py(r('Boston'))

We add few columns and datats for exercise proposes

In [4]:
boston['inverse_zn'] = 1/boston['zn']
boston['ones'] = boston['inverse_zn'] * boston['zn']
boston['stupid'] = 'stupid'

boston2 = boston[['medv', 'ones']]

boston_lstat = boston[['lstat', 'medv']]
boston.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,inverse_zn,ones,stupid
1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0,0.055556,1.0,stupid
2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6,inf,NaN,stupid
3,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7,inf,NaN,stupid
4,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4,inf,NaN,stupid
5,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2,inf,NaN,stupid

### 1. Renaming columns in pandas
http://stackoverflow.com/questions/11346283/renaming-columns-in-pandas

Rename columns in boston_lstat to 'lower_status', 'median_value'

In [6]:
boston_lstat.columns = ['lower_status', 'median_value']
print(boston_lstat.columns)

Index(['lower_status', 'median_value'], dtype='object')

### 2. Delete column from pandas DataFrame
http://stackoverflow.com/questions/13411544/delete-column-from-pandas-dataframe

Delete 'stupid' column from boston.

In [9]:
if 'stupid' in boston.columns:
    del boston['stupid']

### 3. Adding new column to existing DataFrame in Python pandas

http://stackoverflow.com/questions/12555323/adding-new-column-to-existing-dataframe-in-python-pandas

Create boston3 DataFrame that contains all rows from boston2 that have 'medv' > 24. Then create new column 'normal' and assign to each row a number sampled from normal distribution with mu=100 and sigma=20.

In [14]:
from numpy.random import normal

mu=100
sigma = 20

boston3 = boston2.loc[boston2['medv'] > 24].copy()
n=boston3.shape[0]
boston3['normal'] = normal(loc=mu, scale=sigma, size=n)

In [15]:
boston3.head()

   medv  ones      normal
3  34.7   NaN  133.349476
4  33.4   NaN   89.882402
5  36.2   NaN   94.350466
6  28.7   NaN  128.135801
8  27.1   1.0  102.386388

### 4. add one row in a pandas.DataFrame

http://stackoverflow.com/questions/10715965/add-one-row-in-a-pandas-dataframe

I understand that pandas is designed to load fully populated DataFrame but I need to create an empty DataFrame then add rows, one by one. What is the best way to do this ?

Create empty DataFrame 'best_dses' with columns 'people' and 'salary', and then add rows, one by one:
"Carlos" 1,000,000, 
"Aleix" 10,000
"Bartek" 8,000.

In [25]:
best_dses = pd.DataFrame(columns=['people','salary'])

best_dses.loc[0] = {'people':'Carlos', 'salary':1000000}
best_dses.loc[1] = {'people':'Aleix', 'salary':10000}
best_dses.loc[2] = {'people': 'Bartek', 'salary':8000}
best_dses

   people     salary
0  Carlos  1000000.0
1   Aleix    10000.0
2  Bartek     8000.0

### 5. How to drop rows of Pandas dataframe whose value of certain column is NaN
http://stackoverflow.com/questions/13413590/how-to-drop-rows-of-pandas-dataframe-whose-value-of-certain-column-is-nan

Do it with boston2's column 'ones'.

In [35]:
boston2.dropna(axis=0, how='any', subset=['ones'],inplace=False).head()

    medv  ones
1   24.0   1.0
7   22.9   1.0
8   27.1   1.0
9   16.5   1.0
10  18.9   1.0

### 6. Pandas: change data type of columns
http://stackoverflow.com/questions/15891038/pandas-change-data-type-of-columns

Change type of column salary in best_dses to int (or to float if already it is int).

In [43]:
best_dses[['people','salary']].astype(np.string_)

      people        salary
0  b'Carlos'  b'1000000.0'
1   b'Aleix'    b'10000.0'
2  b'Bartek'     b'8000.0'

### 7. Selecting columns
http://stackoverflow.com/questions/11285613/selecting-columns

Select columns 'age' and 'lstat' from boston and save it to boston_select DataFrame

In [45]:
boston_select = boston[['age','lstat']].copy()
boston_select.head()

    age  lstat
1  65.2   4.98
2  78.9   9.14
3  61.1   4.03
4  45.8   2.94
5  54.2   5.33

### 8. Get list from pandas DataFrame column headers
http://stackoverflow.com/questions/19482970/get-list-from-pandas-dataframe-column-headers

get list of column names of boston

In [47]:
list(boston.columns)

['crim',
 'zn',
 'indus',
 'chas',
 'nox',
 'rm',
 'age',
 'dis',
 'rad',
 'tax',
 'ptratio',
 'black',
 'lstat',
 'medv',
 'inverse_zn',
 'ones']

### 9. How to filter the DataFrame rows of pandas by “within”/“in”? (use a list of values to select rows from a pandas dataframe)

http://stackoverflow.com/questions/12065885/how-to-filter-the-dataframe-rows-of-pandas-by-within-in
http://stackoverflow.com/questions/12096252/use-a-list-of-values-to-select-rows-from-a-pandas-dataframe

Select row that has values from list [24, 21.6]

In [55]:
values = [24,21.6]
boston[boston['medv'].isin(values)]

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,black,lstat,medv,inverse_zn,ones
1,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0,0.055556,1.0
2,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6,inf,NaN
236,0.33045,0.0,6.20,0,0.507,6.086,61.5,3.6519,8,307.0,17.4,376.75,10.88,24.0,inf,NaN
314,0.26938,0.0,9.90,0,0.544,6.266,82.8,3.2628,4,304.0,18.4,393.39,7.90,21.6,inf,NaN

### 10. Convert list of dictionaries to Dataframe
http://stackoverflow.com/questions/20638006/convert-list-of-dictionaries-to-dataframe

Transform best_dses.to_dict('records') to DataFrame

In [48]:
best_dses.to_dict('records')

[{'people': 'Carlos', 'salary': 1000000.0},
 {'people': 'Aleix', 'salary': 10000.0},
 {'people': 'Bartek', 'salary': 8000.0}]

In [50]:
X = pd.DataFrame(best_dses.to_dict('records'))